%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%                        PO区域遮蔽可靠性判断                              %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
load('PO.mat');
load('PO_I_s.mat');
C=repmat(sita_PO,1,3)';
for m=1:T_NUM_PO               %绘图
    N = t_PO(m,:)';            %取出第m个三角面片对应的三个节点编号
    X(1:3,m)=[p_PO(N,1)];      %三个节点的x坐标
    Y(1:3,m)=[p_PO(N,2)];      %y
    Q(1:3,m)=[p_PO(N,3)];      %z
end
h=fill3(X, Y, Q, C); %绘图
colormap gray;
axis('equal');
rotate3d